Repository: argrath/activitypub
Catalog: omegat/omegat/project_save.tmx
Source language: en
Languages: ja

source: It provides a client to server API for creating, updating and deleting content, as well as a federated server to server API for delivering notifications and content.
ja: これはコンテンツの作成、更新、削除のためのクライアント-サーバ間 API および、 通知とコンテンツを配送するための連合サーバ間 API を提供する。

source: It's likely that ActivityStreams already includes all the vocabulary you need, but even if it doesn't, ActivityStreams can be extended via [JSON-LD].
ja: おそらく ActivityStreams は既にあなたが必要な全ての語彙を 含んでいるでしょうが、もしそうでなければ、ActivityStreams は [JSON-LD] を使って拡張できます。

source: Jessica Tallon and Christine Lemmer-Webber took over as editors when the standard moved to the W3C Social Working Group and did the majority of transition from Erin Shepherd's document to its current state as ActivityPub.
ja: Jessica Tallon と Christine Lemmer-Webber は、 標準が W3C Social Working Group に 移動した時点で編集者を引き継ぎ、 Erin Shepherd の文書から現在の ActivityPub の状態への移行の大部分が行われた。

source: Later she switches to editing on her phone's client, which has no idea what text/x-org is or how to render it to HTML, so it provides a text box to edit the original content instead.
ja: 後に彼女は電話のクライアントでの編集に切り替えました; これは text/x-org が何であるかや、これを HTML にレンダリングする 方法を知らないので、代わりに元の content を編集するための テキストボックスを提供します。

source: Let's say Alyssa wants to catch up with her friend, Ben Bitdiddle.
ja: Alyssa は友人である Ben Bitdiddle と話したいとします。

source: Let's see an example!
ja: 例を見てみましょう!

source: Let's see how that works:
ja: これがどのように働くのかを見てみましょう:

source: Like other ActivityStreams objects, actors have an id, which is a URI.
ja: 他の ActivityStreams オブジェクトと同様、アクターは URI である id を持つ。

source: Luckily these "inbox" and "outbox" things can help us out.
ja: 幸いにもこれらの "inbox" と "outbox" がその助けになります。

source: Making requests to URIs on localhost which do not require authorization may unintentionally access or modify resources assumed to be protected to be usable by localhost-only.
ja: 認証を必要としない localhost の URI へのリクエストは、localhost でのみ 利用可能として保護されていることを想定されているリソースへのアクセスや修正が 意図せず起きることがある。

source: Many people also helped ActivityPub along through careful review.
ja: また、注意深いレビューを通して多くの人々が ActivityPub を助けた。

source: More detailed "user" modelling, for example linking together of Actors which are controlled by the same entity, or allowing one Actor to be presented through multiple alternate profiles or aspects, are at the discretion of the implementation.
ja: より詳細な「ユーザー」のモデリングとして、 例えば、同じ実体によって制御される複数の Actor を結びつけたり、 一つの Actor を複数のプロファイルや様相を通して表現できるようにすることは、 実装の裁量である。

source: Much of the document was rewritten and reorganized under the long feedback process of the Social Working Group.
ja: Social Working Group の長いフィードバック手続きの下、 文書の多くは書き換えられ、再構成された。

source: No particular mechanism for verification is authoritatively specified by this document, but please see Security Considerations for some suggestions and good practices.
ja: 特定の検証機構をこの文書で命令的に指定することはしないが、 いくつかの提案と良い習慣については セキュリティ上の考慮事項 を参照してほしい。

source: Non-federated servers SHOULD return a 405 Method Not Allowed upon receipt of a POST request.
ja: 非連合サーバは POST リクエストを受け取った場合は 405 Method Not Allowed を 返すべきである(SHOULD)。

source: Note that ActivityPub makes use of ActivityStreams paging to traverse large sets of objects.
ja: ActivityPub は大きなオブジェクトの集合を辿るために ActivityStreams paging を使うことに注意すること。

source: Note that it is acceptable for the object's addressing to be changed later without changing the Create's addressing (for example via an Update activity).
ja: Create のアドレス指定を変更することなく (例えば Update アクティビティで) object のアドレス指定を変更することは 受け入れられることに注意すること。

source: Note that some of these collections are specified to be of type OrderedCollection specifically, while others are permitted to be either a Collection or an OrderedCollection.
ja: これらのコレクションの一部は特に OrderedCollection 型を指定しており、一方その他は Collection または OrderedCollection の両方を許していることに注意すること。

source: Note that this behavior is for client to server interaction where the client is posting to the server only.
ja: この振る舞いは、クライアントがサーバに投稿したときのクライアントからサーバへの 通信のみであることに注意すること。

source: Objects are often wrapped in Activities and are contained in streams of Collections, which are themselves subclasses of Objects.
ja: オブジェクトはしばしば Activity でラッピングされ、自身が Object の サブクラスである Collection に含まれる。

source: Objects are the core concept around which both [ActivityStreams] and ActivityPub are built.
ja: オブジェクトは [ActivityStreams] と ActivityPub 両方の中核となる概念である。

source: Of course, if that last one (GET'ing from someone's outbox) was the only way to see what people have sent, this wouldn't be a very efficient federation protocol!
ja: もちろん、もし最後のもの (誰かの outbox を GET する) が、人々が 送っているものを見る唯一の方法なら、これはとても効率的な 連合プロトコルとは言えません!

source: Once the actor's URI has been identified, it should be dereferenced.
ja: 一旦アクターの URI が識別されると、この参照先を取得するべきである。

source: Origin servers sending publicly addressed activities to sharedInbox endpoints MUST still deliver to actors and collections otherwise addressed (through to, bto, cc, bcc, and audience) which do not have a sharedInbox and would not otherwise receive the activity through the sharedInbox mechanism.
ja: パブリックにアドレス指定されたアクティビティを sharedInbox エンドポイントに送信する送信元サーバは、 その他に (to, bto, cc, bcc, および audience を通して) アドレス指定された、 sharedInbox を持たないので sharedInbox 機構を通じてアクティビティを 受信できない actor やコレクションには配送しなければならない(MUST)。

source: Other documents may supersede this document.
ja: 他の文書がこの文書に取って代わることがある。

source: Otherwise, the entered value should be considered invalid.
ja: さもなければ、入力された値は不正として扱われるべきである。

source: Please contact the GitHub repository regarding this document.
ja: この文書に関する連絡はGitHubリポジトリにお願いします。

source: Please see the Working Group's implementation report.
ja: Working Group の implementation report を参照のこと。

source: Properties containing natural language values, such as name, preferredUsername, or summary, make use of natural language support defined in ActivityStreams.
ja: name, preferredUsername, summary の ような、自然言語値を含む属性は、 natural language support defined in ActivityStreams を使う。

source: Publicly dereferencable URIs, such as HTTPS URIs, with their authority belonging to that of their originating server.
ja: HTTPS URI のような、参照先をパブリックに取得可能な URI で、 その権限が発信元サーバに帰属するもの。

source: Reading from the sharedInbox endpoint MUST NOT present objects which are not addressed to the Public endpoint.
ja: sharedInbox エンドポイントからの読み込みは、 Public エンドポイントにアドレス指定されていないオブジェクトを 表現してはならない(MUST NOT)。

source: Receiving a Create activity in an inbox has surprisingly few side effects; the activity should appear in the actor's inbox and it is likely that the server will want to locally store a representation of this activity and its accompanying object.
ja: inbox に Create アクティビティを受信したときには、 意外にもほとんど副作用はない; このアクティビティは actor の inbox に現れるべきで、 サーバはおそらくこのアクティビティとそれに添付されているオブジェクトの表現を ローカルに保管したいはずである。

source: See also 3. Objects and B.1 Authentication and Authorization.
ja: 3. Objects と B.1 Authentication and Authorization も参照のこと。

source: See the Activity Vocabulary documentation on Inverse Activities and "Undo".
ja: Activity Vocabulary 文書の Inverse Activities and "Undo" を参照のこと。

source: See the ActivityStreams documentation on Inverse Activities and "Undo".
ja: ActivityStreams 文書の Inverse Activities and "Undo" を参照のこと。

source: See the [Activity-Vocabulary] document, particularly the Core Classes; ActivityPub follows the mapping of this vocabulary very closely.
ja: [Activity-Vocabulary] 文書、特に Core Classes を参照のこと; ActivityPub はこの語彙のマッピングに非常に密接に従う。

source: See the description of the Update activity for server to server interactions for more details.
ja: より詳しくは サーバ間相互作用での Update アクティビティ の説明を参照のこと。

source: Server to server interaction and updates from the server to the client should contain the entire new representation of the object, after the partial update application has been applied.
ja: サーバからサーバへの相互作用と、サーバからクライアントへの更新は、 部分的更新が適用された後の、オブジェクトの完全に新しい表現を含むべきであることに注意すること。

source: Servers MAY choose to not explicitly send a Reject in response to a Follow, though implementors ought to be aware that the server sending the request could be left in an intermediate state.
ja: サーバは Follow への応答として明示的に Reject を 送らないという選択をしてもよい(MAY)が、実装者はリクエストを送信したサーバが 中間的な状態のままになるかもしれないことに注意するべきである。

source: Servers MAY implement other behavior for requests which do not comply with the above requirement.
ja: サーバは前述する要求に従わないリクエストに対して他の振る舞いを 実装しても良い(MAY)。

source: Servers MAY interpret a Content-Type or Accept header of application/activity+json as equivalent to application/ld+json; profile="https://www.w3.org/ns/activitystreams" for client-to-server interactions.
ja: サーバはクライアントからサーバへの通信において、 Content-Type や Accept のヘッダで application/activity+json を application/ld+json; profile="https://www.w3.org/ns/activitystreams" と等価と見なしてもよい(MAY)。

source: Servers MAY require authorization as specified in B.1 Authentication and Authorization, and may additionally implement their own authorization rules.
ja: サーバは B.1 Authentication and Authorization で指定された認証を要求したり、 独自の認証規則を実装したりしても良い(MAY)。

source: Servers MAY support uploading document types to be referenced in activites, such as images, video or other binary data, but the precise mechanism is out of scope for this version of ActivityPub.
ja: サーバは、画像、ビデオ、その他のバイナリデータのような、 アクティビティで参照される文書型のアップロードに対応しても良い(MAY)が、 正確な機構はこのバージョンの ActivityPub のスコープ外である。

source: Servers MAY use HTTP content negotiation as defined in [RFC7231] to select the type of data to return in response to a request, but MUST present the ActivityStreams object representation in response to application/ld+json; profile="https://www.w3.org/ns/activitystreams", and SHOULD also present the ActivityStreams representation in response to application/activity+json as well.
ja: リクエストに対するレスポンスとして返すデータの種類を選択するために、 サーバは [RFC7231] で定義されている HTTP content negotiation を使っても良い(MAY)が、 application/ld+json; profile="https://www.w3.org/ns/activitystreams" への返答として ActivityStreams オブジェクト表現を表現しなければならず(MUST)、 application/activity+json への返答としても ActivityStreams 表現を表現するべきである(SHOULD)。

source: Servers MUST also exclude actors from the list which are the same as the actor of the Activity being notified about.
ja: サーバはまた、通知される Activity の actor と同じ actor を リストから除去しなければならない(MUST)。

source: Servers MUST de-duplicate the final recipient list.
ja: サーバは最終的な宛先リストの重複を解消しなければならい(MUST)。

source: Servers MUST limit the number of layers of indirections through collections which will be performed, which MAY be one.
ja: サーバはコレクションの展開を実行する層の数を制限しなければならない(MUST); これは 1 でもよい(MAY)。

source: Servers MUST return a 201 Created HTTP code, and unless the activity is transient, MUST include the new id in the Location header.
ja: サーバは 201 Created HTTP コードを返さなければならず(MUST)、 Activity が一時的なものでない限り、 Location ヘッダに新しい id を 含めなければならない(MUST)。

source: Servers SHOULD NOT deliver Block Activities to their object.
ja: サーバは Block アクティビティをその object に 配送するべきではない(SHOULD NOT)。

source: Servers SHOULD also take care not to overload servers with submissions, for example by using an exponential backoff strategy.
ja: サーバは、例えば指数バックオフ戦略を使うことで、 送信することでサーバを過負荷にしないように気を使うべきである(SHOULD)。

source: Servers SHOULD fail requests which do not pass their authorization checks with the appropriate HTTP error code, or the 403 Forbidden error code where the existence of the object is considered private.
ja: サーバは、認証チェックを通過しなかったリクエストに対して適切な HTTP エラーコードか、 オブジェクトの存在がプライベートなものと考えられる場合は 403 Forbidden エラーコードで失敗するべきである(SHOULD)。

source: Servers SHOULD interpret a Content-Type or Accept header of application/activity+json as equivalent to application/ld+json; profile="https://www.w3.org/ns/activitystreams" for server-to-server interactions.
ja: サーバは、サーバからサーバへの通信において、Content-Type や Accept ヘッダの application/activity+json を application/ld+json; profile="https://www.w3.org/ns/activitystreams" と 等価なものとして扱うべきである(SHOULD)。

source: Servers SHOULD validate the content they receive to avoid content spoofing attacks.
ja: サーバはコンテンツスプーフィング攻撃を防ぐために受信したコンテンツを 検証するべきである(SHOULD)。

source: Servers communicate with other servers and propagate information across the social graph by posting activities to actors' inbox endpoints.
ja: サーバは、activity を actor の inbox エンドポイントに ポストすることで、他のサーバと通信し、情報をソーシャルグラフ上に伝搬させる。

source: Servers performing delivery to the inbox or sharedInbox properties of actors on other servers MUST provide the object property in the activity: Create, Update, Delete, Follow, Add, Remove, Like, Block, Undo.
ja: 他のサーバ上の actor の inbox や publicInbox 属性への配送を実行するサーバは、 次のアクティビティ内に object 属性を提供しなければならない(MUST): Create, Update, Delete, Follow, Add, Remove, Like, Block, Undo。

source: Servers should be careful to verify that new content is really posted by the actor that claims to be posting it, and that the actor has permission to update the resources it claims to.
ja: 新しいコンテンツが、それを投稿したと主張している actor から本当に 投稿されていることと、その actor がそのリソースを更新する権限を 持っていることを、 サーバは慎重に検証するべきである。

source: Servers should be especially careful to implement this protection around activities that involve side effects.
ja: サーバは特に、副作用を引き起こすアクティビティに関する この保護を実装することに注意するべきである。

source: Servers should implement protections against denial-of-service attacks from other, federated servers.
ja: サーバは、その他の連合サーバからのサービス不能攻撃に対する防御を 実装するべきである。

source: Servers should not trust client submitted content, and federated servers also should not trust content received from a server other than the content's origin without some form of verification.
ja: 何らかの形の検証なしに、サーバはクライアントが投稿したコンテンツを 信頼するべきではないし、 連合サーバはコンテンツの発信源以外のサーバから受け取ったコンテンツを 信頼するべきではない。

source: Servers should ratelimit API client submissions.
ja: サーバは API クライアント提案を通信制限するべきである。

source: Servers should set a limit on how deep to recurse while resolving objects, or otherwise specially handle ActivityStreams objects with recursive references.
ja: サーバはオブジェクト、あるいは特に再帰参照を持つ ActivityStream オブジェクトの 解決中にどれだけ深く再帰するかの制限を設定するべきである。

source: She POSTs it to her outbox.
ja: 彼女はこれを彼女の outbox に POST します。

source: She POSTs this message to her outbox.
ja: 彼女はこのメッセージを彼女の outbox に POST します。

source: She lent him a book recently and she wants to make sure he returns it to her.
ja: 彼女は彼に最近本を貸していて、それを返してくれるか確認したいです。

source: Side effects should be undone, to the extent possible.
ja: 副作用として、できるだけ広範囲に取り消しを行うべきである。

source: Similarly, an Actor may represent a piece of software, like a bot, or an automated process.
ja: 同様に、ある Actor はボットや自動化プロセスのようなソフトウェアの 一部を表現しているかもしれない。

source: Since this is a non-activity object, the server recognizes that this is an object being newly created, and does the courtesy of wrapping it in a Create activity.
ja: これは非アクティビティオブジェクトなので、サーバは これは新しく作成されたオブジェクトと認識し、これを Create アクティビティにラッピングします。

source: So, okay.
ja: さて。

source: Some ActivityStreams properties are particularly worth highlighting to demonstrate how they are used in ActivityPub implementations.
ja: 一部の ActivityStreams 属性は特に注目する価値がある; これが ActivityPub 実装でどう使われるかを例示する。

source: Some libraries which handle fetching requests at various URI schemes may try to be smart and reference schemes which may be undesirable, such as file.
ja: ライブラリによっては様々な URI スキームでのフェッチリクエストを扱い、 賢くあろうとして、file のような 想定していないスキームを参照するかもしれない。

source: Some possible directions for authentication are laid out in the Social Web Community Group Authentication and Authorization best practices report.
ja: 認証で取り得る方向性は the Social Web Community Group Authentication and Authorization best practices report にある。

source: Some servers would also like to display a list of all messages posted publicly to the "known network".
ja: 一部のサーバはまた、パブリックに投稿された全てのメッセージのリストを "known network" として表示したい。

source: Sometimes a successful Follow subscription may occur but at some future point delivery to the follower fails for an extended period of time.
ja: 時々、Follow 購読が成功したものの、将来のある時点で 長期間フォロワーへの配送が失敗するようになることがある。

source: Soon the following message is blasted to all the members of her followers collection, and since it has the special Public group addressed, is generally readable by anyone.
ja: ほどなくして以下のメッセージが彼女の followers コレクションの全ての メンバーに送信され、またこれは特殊な Public グループ宛になっているので、 誰でも一般に読むことができます。

source: Spam is a problem in any network, perhaps especially so in federated networks.
ja: スパムはあらゆるネットワークで問題だが、特に連合ネットワークではそうである。

source: Special thanks also goes to Benjamin Goering for putting together the implementation report template.
ja: 実装報告テンプレートを取りまとめた Benjamin Goering にも特に感謝する。

source: Status of This Document
ja: この文書の状態

source: Such deduplication MUST be performed by comparing the id of the activities and dropping any activities already seen.
ja: このような重複解消は、アクティビティの id を比較して、 既に読んだアクティビティを落とす形で行われなければならない(MUST)。

source: Table of Contents
ja: 目次

source: Targets for delivery are determined by checking the ActivityStreams audience targeting; namely, the to, bto, cc, bcc, and audience fields of the activity.
ja: 配送するターゲットは、 ActivityStreams audience targeting をチェックすることで決定される; つまり、アクティビティの to, bto, cc, bcc, audience フィールドである。

source: Technically these are two separate steps... one is client to server communication, and one is server to server communication (federation).
ja: 技術的にはこれは二つに分割されたステップです…一つ目は クライアントからサーバへの通信、もう一つはサーバからサーバへの通信(連合)です。

source: That is, actors shouldn't have their own activities delivered to themselves.
ja: つまり、ユーザーは自分の activity を自分に配送することはできない。

source: The Announce activity is effectively what is known as "sharing", "reposting", or "boosting" in other social networks.
ja: Announce アクティビティは事実上他のソーシャルネットワークでの "sharing", "reposting", "boosting" として知られているものである。

source: The Block activity is used to indicate that the posting actor does not want another actor (defined in the object property) to be able to interact with objects posted by the actor posting the Block activity.
ja: Block アクティビティは、投稿したアクターは (object属性で定義された)アクターが Block アクティビティを投稿したアクターによって投稿された オブジェクトと相互作用出来ることを望まないことを示すために使われる。

source: The Create activity is used when posting a new object.
ja: Create アクティビティは新しいオブジェクトを投稿するときに使われる。

source: The Delete activity is used to delete an already existing object.
ja: Delete アクティビティは、既に存在するオブジェクトを 削除するために使われる。

source: The Follow activity is used to subscribe to the activities of another actor.
ja: Follow アクティビティは、他の actor のアクティビティを 購読するために使われる。

source: The Followers Collection and/or the Public Collection are good choices for the default addressing of new Activities.
ja: Followers Collection と Public Collection は、 新しい Activity のデフォルトの宛先として良い選択肢である。

source: The Like activity indicates the actor likes the object.
ja: Like アクティビティは actor が object を好んでいることを示す。

source: The Location value returned by the server should be the URL of the new Create activity (rather than the object).
ja: サーバから返された Location の値は、 新しい(オブジェクトではなく) Create アクティビティの URL であるべきである。

source: The Undo activity is used to undo a previous activity.
ja: Undo アクティビティは以前のアクティビティを取り消すときに使われる。

source: The Undo activity is used to undo the side effects of previous activities.
ja: Undo アクティビティは、以前のアクティビティの副作用を 取り消すために使われる。

source: The Update activity is used when updating an already existing object.
ja: Update アクティビティは、既に存在するオブジェクトを更新するときに 使われる。

source: The endpoints mapping MAY include the following properties:
ja: endpoints マッピングは以下の属性を含んでいても良い(MAY):

source: The inbox is determined by first retrieving the target actor's JSON-LD representation and then looking up the inbox property.
ja: inbox はまず ターゲットactorのJSON-LD表現を取得し、 それから inbox 属性を探すことで決定される。

source: The to, bto, cc, bcc or audience fields if their values are individuals or Collections owned by the actor.
ja: to, bto, cc, bcc, audience のいずれかのフィールド; その値が 個人かactorに所有されているコレクションの場合。

source: The following collection MUST be either an OrderedCollection or a Collection and MAY be filtered on privileges of an authenticated user or as appropriate when no authentication is given.
ja: following コレクションは OrderedCollection または Collection でなければならず(MUST)、 認証されたユーザーの権限や、認証がない場合は適切な形でフィルタリングしても 良い(MAY)。

source: The inbox MUST be an OrderedCollection.
ja: inbox は OrderedCollection でなければならない(MUST)。

source: The outbox MUST be an OrderedCollection.
ja: outbox は OrderedCollectionでなければならない(MUST)。

source: The W3C Internationalization group provides some guidance on language detection.
ja: W3C Internationalization group はいくつかの 言語検出のガイド を提供している。

source: The liked collection MUST be either an OrderedCollection or a Collection and MAY be filtered on privileges of an authenticated user or as appropriate when no authentication is given.
ja: liked コレクションは OrderedCollection または Collection でなければならず(MUST)、 認証されたユーザーの権限や、認証がない場合は適切な形でフィルタリングしても 良い(MAY)。

source: The followers collection MUST be either an OrderedCollection or a Collection and MAY be filtered on privileges of an authenticated user or as appropriate when no authentication is given.
ja: followers コレクションは OrderedCollection または Collection でなければならず(MUST)、 認証されたユーザーの権限や、認証がない場合は適切な形でフィルタリングしても 良い(MAY)。

source: The likes collection MUST be either an OrderedCollection or a Collection and MAY be filtered on privileges of an authenticated user or as appropriate when no authentication is given.
ja: likes コレクションは OrderedCollection または Collection でなければならず(MUST)、 認証されたユーザーの権限や、認証がない場合は適切な形でフィルタリングしても 良い(MAY)。

source: The shares collection MUST be either an OrderedCollection or a Collection and MAY be filtered on privileges of an authenticated user or as appropriate when no authentication is given.
ja: shares コレクションは OrderedCollection または Collection でなければならず(MUST)、 認証ユーザーの権限によってや、認証が与えられなかったときに適切になるように、 フィルタリングしても良い(MAY)。

source: The source property is intended to convey some sort of source from which the content markup was derived, as a form of provenance, or to support future editing by clients.
ja: source 属性は、content マークアップが 由来するなんらかのソースを出所の形式として伝えたり、 クライアントによる将来の編集に対応することを意図している。

source: The Accept or Reject MAY be generated automatically, or MAY be the result of user input (possibly after some delay in which the user reviews).
ja: Accept や Reject は自動的に生成しても良い(MAY)し、 (おそらくはユーザーの確認のための多少の遅延の後)ユーザー入力の 結果としてもよい(MAY)。

source: The Activity might appear after a delay or disappear at any period).
ja: Activity は遅延して現れたり、任意の時点で消滅したりするかもしれない。)

source: The ActivityPub protocol is a decentralized social networking protocol based upon the [ActivityStreams] 2.0 data format.
ja: ActivityPub プロトコルは、[ActivityStreams] 2.0 データ形式を基とした 非中央集権型ソーシャルネットワークプロトコルである。

source: The ActivityPub specification is designed so that once either of these protocols are implemented, supporting the other is of very little additional effort.
ja: ActivityPub 仕様は、一旦これらのどちらかのプロトコルが実装されると、 もう片方への対応はほとんど追加の作業が不要であるように設計されている。

source: The HTTP GET method may be dereferenced against an object's id property to retrieve the activity.
ja: アクティビティを取得するために、 オブジェクトの id 属性に対して HTTP GET メソッドを使うことがある。

source: The Social Web Community Group is refining the protocol in the ActivityPub Media Upload report.
ja: The Social Web Community Group は ActivityPub Media Upload report でプロトコルを洗練させている。

source: The above example could be converted to this:
ja: 前述の例は以下のように変換される:

source: The body of the POST request MUST contain a single Activity (which MAY contain embedded objects), or a single non-Activity object which will be wrapped in a Create activity by the server.
ja: POST リクエストのボディは、単一の Activity (組み込みオブジェクトを含んでいても良い(MAY))、あるいは サーバによって Create アクティビティにラッピングされる 単一の非 Activity オブジェクトのどちらかを含んでいなければならない(MUST)。

source: The client MUST specify an Accept header with the application/ld+json; profile="https://www.w3.org/ns/activitystreams" media type in order to retrieve the activity.
ja: クライアントはアクティビティを取得するために Accept ヘッダに application/ld+json; profile="https://www.w3.org/ns/activitystreams" メディアタイプを指定しなければならない(MUST)。

source: The follow activity generally is a request to see the objects an actor creates.
ja: follow アクティビティは一般的には、ある actor が作成したオブジェクトを 見るための要求である。

source: The following section is to mitigate the "ghost replies" problem which occasionally causes problems on federated networks.
ja: 以下の節は、連合ネットワークで時々問題を引き起こす、 「ゴーストリプライ」問題を緩和するためのものである。
